---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizes.GetBasicIEnumerator
source: html/99e82d00-de56-f5b4-348e-9e0cea6daa46.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizes.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.